Revit 2027 API
TriangulatedShellComponent.GetVertices Method
 Returns the vertices of the triangulation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<XYZ> GetVertices()
Public Function GetVertices As IList(Of XYZ)
public:
IList<XYZ^>^ GetVertices()
member GetVertices : unit -> IList<XYZ>
Return Value
IList<XYZ>
 The vertices of the triangulation.
See Also
Reference
TriangulatedShellComponent Class
Autodesk.Revit.DB Namespace